---
kind: method
id: M:Autodesk.Revit.DB.View3D.GetOrientation
zh: 三维视图、3d视图
source: html/58374361-7bfa-aceb-ac4e-bc74024dd657.htm
---
# Autodesk.Revit.DB.View3D.GetOrientation Method

**中文**: 三维视图、3d视图

Gets the current non-saved orientation of the View3D.

## Syntax (C#)
```csharp
public ViewOrientation3D GetOrientation()
```

## Returns
The current non-saved orientation of the View3D.